GB_RULE_TABLE = 
{
	{
		title = "术语介绍"
	},
    {
        term = "圈风：",
        description = "每局比赛圈数的标志。第一圈为东风圈，第二圈为南风圈，第三圈为西风圈，第四圈为北风圈。"
    },
    {
        term = "门风：",
        description = "玩家每盘座位的标志。庄家为东风，下家为南风，对家为西风，上家为北风。"
    },
    {
        term = "庄家、旁家：",
        description = "门风东者为庄家，其余均为旁家。无论是否和牌，庄家不连庄。"
    },
    {
        term = "刻子：",
        description = "3张相同的牌。碰出的为明刻，抓在手中的为暗刻。"
    },
    {
        term = "对子：",
        description = "两张相同的牌。"
    },
    {
        term = "字牌：",
        description = "指风牌和箭牌，风牌为东、南、西、北。箭牌为中、发、白。"
    },
    {
        term = "幺九牌：",
        description = "序牌中的一、九及字牌。"
    },
    {
        term = "吃牌：",
        description = "指上家打出牌后，报“吃”者把自己的两张牌取出, 加在一起组成顺子，并且将此副牌摆亮在立牌前。"
    },
    {
        term = "碰牌：",
        description = "指任一家打出牌后，报“碰”者把自己的对子取出，加在一起组成一副刻子，并且将此副牌摆亮在立牌前。"
    },
    {
        term = "杠：",
        description = "报开杠的4张相同的牌。"
    },
    {
        term = "补花：",
        description = "抓到花牌后，明放在立牌前，并从牌墙最后补一张牌。"
    },
    {
        term = "听牌：",
        description = "只差所需要的一张牌即能和牌的状态。"
    },
    {
        term = "和牌：",
        description = "只差所需要的一张牌即能和牌的状态。"
    },
    {
        term = "自摸：",
        description = "自己抓进成和的牌，并报和牌。"
    },
    {
        term = "点和：",
        description = "又称点炮和牌，意为和他人打出的牌。"
    },
    {
        term = "流局：",
        description = "每盘抓完所有牌，打出后仍无人和牌。流局不进行金币结算。"
    }
}

GB_FAN_TABLE = 
{
    {
        title = "番型"
    },
    {
        fan  = "88番",
    },
    {
        term = "大四喜：",
        description = "由4副风刻（杠）组成的和牌。不计圈风刻、门风刻、三风刻、碰碰和。",
        cards = {0x31, 0x31, 0x31, 0x32, 0x32, 0x32, 0x33, 0x33, 0x33, 0x34, 0x34, 0x34, 0x05, 0x05},
    },
    {
        term = "大三元：",
        description = "和牌中，有中发白3副刻子。不计箭刻。",
        cards = {0x41, 0x41, 0x41, 0x42, 0x42, 0x42, 0x43, 0x43, 0x43, 0x01, 0x02, 0x03, 0x22, 0x22},
    },
    {
        term = "绿一色：",
        description = "由23468条及发字中的任何牌组成的顺子、刻五、将的和牌。不计混一色。如无“发”字组成的各牌，可计清一色。",
        cards = {0x22, 0x23, 0x24, 0x24, 0x24, 0x24, 0x26, 0x26, 0x26, 0x28, 0x28, 0x28, 0x42, 0x42},
    },
    {
        term = "九莲宝灯：",
        description = "由一种花色序数牌子按1112345678999组成的特定牌型，见同花色任何1张序数牌即成和牌。不计清一色。",
        cards = {0x01, 0x01, 0x01, 0x02, 0x03, 0x04, 0x05, 0x05, 0x06, 0x07, 0x8, 0x09, 0x09, 0x09},
    },
    {
        term = "四杠：",
        description = "4个杠。",
        cards = {0x01, 0x01, 0x01, 0x01, 0x12, 0x12, 0x12, 0x12, 0x23, 0x23, 0x23, 0x23, 0x31, 0x31, 0x31, 0x31, 0x42, 0x42},
    },
    {
        term = "连七对：",
        description = "由一种花色序数牌组成序数相连的7个对子的和牌。不计清一色、不求人、单钓。",
        cards = {0x22, 0x22, 0x23, 0x23, 0x24, 0x24, 0x25, 0x25, 0x26, 0x26, 0x27, 0x27, 0x28, 0x28},
    },
    {
        term = "十三幺：",
        description = "由3种序数牌的一、九牌，7种字牌及其中一对作将组成的和牌。不计五门齐、不求人、单钓。",
        cards = {0x01, 0x09, 0x11, 0x19, 0x21, 0x29, 0x31, 0x32, 0x33, 0x34, 0x41, 0x42, 0x43, 0x43},
    },
    {
        fan  = "64番",
    },
    {
        term = "清幺九：",
        description = "由序数牌一、九刻子组成的和牌。不计碰碰和、同刻、无字。",
        cards = {0x01, 0x01, 0x01, 0x09, 0x09, 0x09, 0x11, 0x11, 0x11, 0x29, 0x29, 0x29, 0x19, 0x19},
    },
    {
        term = "小四喜：",
        description = "和牌时有风牌的3副刻子及将牌。不计三风刻。",
        cards = {0x31, 0x31, 0x31, 0x32, 0x32, 0x32, 0x33, 0x33, 0x33, 0x01, 0x02, 0x03, 0x34, 0x34},
    },
    {
        term = "小三元：",
        description = "和牌时有箭牌的两副刻子及将牌。不计箭刻。",
        cards = {0x41, 0x41, 0x41, 0x42, 0x42, 0x42, 0x01, 0x01, 0x01, 0x02, 0x03, 0x04, 0x43, 0x43},
    },
    {
        term = "字一色：",
        description = "由字牌的刻子（杠）、将组成的和牌。不计碰碰和。",
        cards = {0x31, 0x31, 0x31, 0x34, 0x34, 0x34, 0x41, 0x41, 0x41, 0x42, 0x42, 0x42, 0x33, 0x33},
    },
    {
        term = "四暗刻：",
        description = "4个暗刻（暗杠）。不计门前清、碰碰和。",
    },
    {
        term = "一色双龙会：",
        description = "一种花色的两个老少副，5为将牌。不计平各、七对、清一色。",
        cards = {0x21, 0x22, 0x23, 0x21, 0x22, 0x23, 0x25, 0x25, 0x27, 0x28, 0x29, 0x27, 0x28, 0x29},
    },
    {
        fan  = "48番",
    },
    {
        term = "一色四同顺：",
        description = "一种花色4副序数相同的顺子，不计一色三节高、一般高、四归一。",
        cards = {0x22, 0x23, 0x24, 0x22, 0x23, 0x24, 0x22, 0x23, 0x24, 0x22, 0x23, 0x24, 0x21, 0x21},
    },
    {
        term = "一色四节高：",
        description = "一种花色4副依次递增一位数的刻子不计一色三同顺、碰碰和。",
        cards = {0x11, 0x11, 0x11, 0x12, 0x12, 0x12, 0x13, 0x13, 0x13, 0x14, 0x14, 0x14, 0x29, 0x29},
    },
    {
        fan  = "32番",
    },
    {
        term = "一色四步高：",
        description = "一种花色4副依次递增一位数或依次递增二位数的顺子。",
        cards = {0x02, 0x03, 0x04, 0x03, 0x04, 0x05, 0x04, 0x05, 0x06, 0x05, 0x06, 0x07, 0x33, 0x33},
    },
    {
        term = "三杠：",
        description = "3个杠。",
        cards = {0x01, 0x01, 0x01, 0x01, 0x05, 0x05, 0x05, 0x05, 0x15, 0x15, 0x15, 0x15, 0x25, 0x26, 0x27, 0x42, 0x42},
    },
    {
        term = "混幺九：",
        description = "由字牌和序数牌一、九的刻子用将牌组成的和牌。不计碰碰和。",
        cards = {0x21, 0x21, 0x21, 0x09, 0x09, 0x09, 0x011, 0x11, 0x11, 0x32, 0x32, 0x32, 0x05, 0x05},
    },
    {
        fan  = "24番",
    },
    {
        term = "七对：",
        description = "由7个对子组成和牌。不计不求人、单钓。",
        cards = {0x01, 0x01, 0x05, 0x05, 0x09, 0x09, 0x15, 0x15, 0x22, 0x22, 0x25, 0x25, 0x33, 0x33},
    },
    {
        term = "七星不靠：",
        description = "须有7个单张的东西南北中发白，加上3种花色，数位按147、258、369中的7张序数牌组成没有将牌的和牌。不计五门齐、不求人、单钓。",
        cards = {0x01, 0x04, 0x13, 0x16, 0x19, 0x22, 0x28, 0x31, 0x32, 0x33, 0x34, 0x41, 0x42, 0x43},
    },
    {
        term = "全双刻：",
        description = "由2、4、6、8序数牌的刻子、将牌组成的和牌。不计碰碰和、断幺。",
        cards = {0x12, 0x12, 0x12, 0x18, 0x18, 0x18, 0x26, 0x26, 0x26, 0x28, 0x28, 0x28, 0x24, 0x24},
    },
    {
        term = "清一色：",
        description = "由一种花色的序数牌组成和各牌。不计无字。",
        cards = {0x01, 0x01, 0x01, 0x04, 0x04, 0x04, 0x05, 0x06, 0x07, 0x07, 0x08, 0x09, 0x02, 0x02},
    },
    {
        term = "一色三同顺：",
        description = "和牌时有一种花色3副序数相同的顺子。不计一色三节高。",
        cards = {0x11, 0x12, 0x13, 0x11, 0x12, 0x13, 0x11, 0x12, 0x13, 0x01, 0x02, 0x03, 0x05, 0x05},
    },
    {
        term = "一色三节高：",
        description = "和牌时有一种花色3副依次递增一位数字的刻子。不计一色三同顺。",
        cards = {0x25, 0x25, 0x25, 0x26, 0x26, 0x26, 0x27, 0x27, 0x27, 0x01, 0x02, 0x03, 0x41, 0x41},
    },
    {
        term = "全大：",
        description = "由序数牌789组成的顺子、刻子（杠）、将牌的和牌。不计无字。",
        cards = {0x27, 0x28, 0x29, 0x07, 0x08, 0x09, 0x17, 0x18, 0x19, 0x17, 0x18, 0x19, 0x29, 0x29},
    },
    {
        term = "全中：",
        description = "由序数牌456组成的顺子、刻子（杠）、将牌的和牌。不计断幺。",
        cards = {0x04, 0x05, 0x06, 0x14, 0x14, 0x14, 0x15, 0x15, 0x15, 0x26, 0x26, 0x26, 0x05, 0x05},
    },
    {
        term = "全小：",
        description = "由序数牌123组成的顺子、刻子（杠）将牌的的和牌。不计无字。",
        cards = {0x11, 0x12, 0x13, 0x01, 0x02, 0x03, 0x21, 0x22, 0x23, 0x21, 0x22, 0x23, 0x01, 0x01},
    },
    {
        fan  = "16番",
    },
    {
        term = "清龙：",
        description = "和牌时，有一种花色1-9相连接的序数牌。",
        cards = {0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x33, 0x33, 0x33, 0x15, 0x15},
    },
    {
        term = "三色双龙会：",
        description = "2种花色2个老少副、另一种花色5作将的和牌。不计喜相逢、老少副、无字、平和。",
        cards = {0x01, 0x02, 0x03, 0x07, 0x08, 0x09, 0x11, 0x12, 0x13, 0x17, 0x18, 0x19, 0x25, 0x25},
    },
    {
        term = "一色三步高：",
        description = "和牌时，有一种花色3副依次递增一位或依次递增二位数字的顺子。",
        cards = {0x13, 0x14, 0x15, 0x14, 0x15, 0x16, 0x15, 0x16, 0x17, 0x01, 0x02, 0x03, 0x25, 0x25},
    },
    {
        term = "全带五：",
        description = "每副牌及将牌必须有5的序数牌。不计断幺。",
        cards = {0x04, 0x05, 0x06, 0x15, 0x16, 0x17, 0x23, 0x24, 0x25, 0x24, 0x25, 0x26, 0x05, 0x05},
    },
    {
        term = "三同刻：",
        description = "3个序数相同的刻子（杠）。",
        cards = {0x05, 0x05, 0x05, 0x15, 0x15, 0x15, 0x25, 0x25, 0x25, 0x01, 0x02, 0x03, 0x09, 0x09},
    },
    {
        term = "三暗刻：",
        description = "3个暗刻。",
    },
    {
        fan  = "12番",
    },
    {
        term = "全不靠：",
        description = "单张3种花色147、258、369不能错位的序数牌及东南西北中发白中的任何14张牌组成的和牌。不计五门齐、不求人、单钓。",
        cards = {0x01, 0x04, 0x07, 0x12, 0x15, 0x18, 0x23, 0x26, 0x29, 0x31, 0x33, 0x34, 0x41, 0x42},
    },
    {
        term = "组合龙：",
        description = "3种花色的147、258、369不能错位的序数牌。",
        cards = {0x01, 0x04, 0x07, 0x12, 0x15, 0x18, 0x23, 0x26, 0x29, 0x06, 0x07, 0x08, 0x29, 0x29},
    },
    {
        term = "大于五：",
        description = "由序数牌6-9的顺子、刻子、将牌组成的和牌。不计无字。",
        cards = {0x06, 0x07, 0x08, 0x16, 0x17, 0x18, 0x29, 0x29, 0x29, 0x28, 0x28, 0x28, 0x09, 0x09},
    },
    {
        term = "小于五：",
        description = "由序数牌1-4的顺子、刻子、将牌组成的和牌。不计无字。",
        cards = {0x01, 0x02, 0x03, 0x04, 0x04, 0x04, 0x12, 0x12, 0x12, 0x21, 0x22, 0x23, 0x24, 0x24},
    },
    {
        term = "三风刻：",
        description = "3个风刻。",
        cards = {0x31, 0x31, 0x31, 0x32, 0x32, 0x32, 0x33, 0x33, 0x33, 0x01, 0x02, 0x03, 0x05, 0x05},
    },
    {
        fan  = "8番",
    },
    {
        term = "花龙：",
        description = "3种花色的3副顺子连接成1-9的序数牌。",
        cards = {0x01, 0x02, 0x03, 0x14, 0x15, 0x16, 0x27, 0x28, 0x29, 0x27, 0x28, 0x29, 0x43, 0x43},
    },
    {
        term = "推不倒：",
        description = "由牌面图形没有上下区别的牌组成的和牌，包括1234589饼、245689条、白板。不计缺一门。",
        cards = {0x13, 0x14, 0x15, 0x19, 0x19, 0x19, 0x24, 0x25, 0x26, 0x29, 0x29, 0x29, 0x13, 0x13},
    },
    {
        term = "三色三同顺：",
        description = "和牌时，有3种花色3副序数相同的顺子。",
        cards = {0x01, 0x02, 0x03, 0x11, 0x12, 0x13, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x07, 0x07},
    },
    {
        term = "三色三节高：",
        description = "和牌时，有3种花色3副依次递增一位数的刻子。",
        cards = {0x07, 0x07, 0x07, 0x18, 0x18, 0x18, 0x29, 0x29, 0x29, 0x31, 0x31, 0x31, 0x41, 0x41},
    },
    {
        term = "无番和：",
        description = "和牌后，数不出任何番种分（花牌不计算在内）。",
    },
    {
        term = "妙手回春：",
        description = "自摸牌墙上最后一张牌和牌。不计自摸。",
    },
    {
        term = "海底捞月：",
        description = "和打出的最后一张牌。",
    },
    {
        term = "杠上开花：",
        description = "开杠抓进的牌成和牌（不包括补花）不计自摸。",
    },
    {
        term = "抢杠和：",
        description = "和别人自抓开明杠的牌。不计和绝张。",
    },
    {
        fan  = "6番",
    },
    {
        term = "碰碰和：",
        description = "由4副刻子（或杠）、将牌组成的和牌。",
        cards = {0x14, 0x14, 0x14, 0x06, 0x06, 0x06, 0x22, 0x22, 0x22, 0x34, 0x34, 0x34, 0x25, 0x25}
    },
    {
        term = "混一色：",
        description = "由一种花色序数牌及字牌组成的和牌。",
        cards = {0x01, 0x02, 0x03, 0x06, 0x06, 0x06, 0x32, 0x32, 0x32, 0x02, 0x03, 0x04, 0x31, 0x31}
    },
    {
        term = "三色三步高：",
        description = "3种花色3副依次递增一位序数的顺子。",
        cards = {0x03, 0x04, 0x05, 0x14, 0x15, 0x16, 0x25, 0x26, 0x27, 0x05, 0x05, 0x05, 0x15, 0x15}
    },
    {
        term = "五门齐：",
        description = "和牌时3种序数牌、风、箭牌齐全。",
        cards = {0x01, 0x02, 0x03, 0x21, 0x22, 0x23, 0x27, 0x28, 0x29, 0x33, 0x33, 0x33, 0x41, 0x41}
    },
    {
        term = "全求人：",
        description = "全靠吃牌、碰牌、单钓别人批出的牌和牌。不计单钓。",
    },
    {
        term = "双暗杠：",
        description = "2个暗杠。",
    },
    {
        term = "双箭刻：",
        description = "2副箭刻（或杠）。",
    },
    {
        fan  = "4番",
    },
    {
        term = "全带幺：",
        description = "和牌时，每副牌、将牌都有幺牌。",
    },
    {
        term = "不求人：",
        description = "4副牌及将中没有吃牌、碰牌（包括明杠），自摸和牌。",
    },
    {
        term = "双明杠：",
        description = "2个明杠。",
    },
    {
        term = "和绝张：",
        description = "和牌池、桌面已亮明的3张牌所剩的第4张牌（抢杠和不计和绝张）。",
    },
     {
        fan  = "2番",
    },
    {
        term = "箭刻：",
        description = "由中、发、白3张相同的牌组成的刻子。",
    },
    {
        term = "圈风刻：",
        description = "与圈风相同的风刻。",
    },
    {
        term = "门风刻：",
        description = "与本门风相同的风刻。",
    },
    {
        term = "门前清：",
        description = "没有吃、碰、明杠，和别人打出的牌。",
    },
    {
        term = "平和：",
        description = "由4副顺子及序数牌作将组成的和牌，边、坎、钓不影响平和。",
    },
    {
        term = "四归一：",
        description = "和牌中，有4张相同的牌归于一家的顺、刻子、对、将牌中（不包括杠牌）。",
    },
    {
        term = "双同刻：",
        description = "2副序数相同的刻子。",
    },
    {
        term = "双暗刻：",
        description = "2个暗刻。",
    },
    {
        term = "暗杠：",
        description = "自抓4张相同的牌开杠。",
    },
    
    {
        term = "断幺：",
        description = "和牌中没有一、九及字牌。",
    },
    {
        term = "独听：",
        description = "以听牌状态胡牌时，全场没有第二个听牌者。",
    },
    {
        fan  = "1番",
    },
    {
        term = "一般高：",
        description = "由一种花色2副相同的顺子组成的牌。",
    },
    {
        term = "喜相逢：",
        description = "2种花色2副序数相同的顺子。",
    },
    {
        term = "连六：",
        description = "一种花色6张相连接的序数牌。",
    },
    {
        term = "老少副：",
        description = "一种花色牌的123、789两副顺子。",
    },
    {
        term = "幺九刻：",
        description = "3张相同的一、九序数牌及字牌组成的刻子（或杠）。",
    },
    {
        term = "明杠：",
        description = "自己有暗刻，碰别人打出的一张相同的牌开杠：或自己抓进一张与碰的明刻相同的牌开杠。",
    },
    {
        term = "缺一门：",
        description = "和牌中缺少一种花色序数牌。",
    },
    {
        term = "无字：",
        description = "和牌中没有风、箭牌。",
    },
    {
        term = "边张：",
        description = "单和123的3及789的7或1233和3、77879和7都为张。手中有12345和3，56789和6不算边张。",
    },
    {
        term = "坎张：",
        description = "和2张牌之间的牌。4556和5也为坎张，手中有45567和6不算坎张。",
    },
    {
        term = "单钓将：",
        description = "钓单张牌作将成和。",
    },
    {
        term = "自摸：",
        description = "自己抓进牌成和牌。",
    },
    {
        term = "花牌：",
        description = "即春夏秋冬，梅兰竹菊，每花计一分。不计在起和分内，和牌后才能计分。花牌补花成和计自摸分，不计杠上开花。",
    },

}