SH_RULE_TABLE = 
{
	{
        title = "术语介绍",
    },
    {
        term = "用牌：",
        description = "筒36张、万36张、条36张、风字28张，外加春夏秋冬梅兰竹菊各1张共8张，一共136+8=144张。"
    },
    {
        term = "打牌：",
        description = "游戏在一开始，只有庄家可得到十四张牌，其余的人十三张。庄家从牌中选出一张最无用的牌丢出。此时，其它三家都有权力要那张丢出的牌。庄家的下家（右手边的玩者），有权力吃或碰那张牌，其它两家则只可碰或杠那张牌。“碰”比“吃”优先。"
    },
    {
        term = "吃碰杠牌：",
        description = "可以任意吃碰杠牌，吃碰杠牌后必须亮明，暗杠除外。"
    },
    {
        term = "庄家：",
        description = "第一局系统随机选择庄家；谁胡牌下盘当庄家，若流局则上盘庄家下盘继续当庄家；炮胡且一炮2响或3响，点炮者最近的一个胡牌者下家为下盘庄家。"
    },
    {
        term = "摇骰子：",
        description = "2个骰子，取牌方向为从摇骰子者逆时针计算2个骰子之和，取牌的位置按照顺时针计算2个骰子之和。比如一个骰子2、一个骰子5，那么总和为7，从摇骰子玩家的对家方向先挪走7墩牌后开始摸牌。"
    },
    {
        term = "漏胡：",
        description = "若玩家A为叫胡的状态下，如下家B打出一张玩家A可以胡的牌而玩家A却放弃不胡，那若对家C或上家D打出相同的一张牌时，玩家A是不能胡那一张的。除非玩家A有进行动牌的情况，动牌的意思在于碰、上、杠、模牌的。当有动牌后，那不能胡那一张的规则便解除。漏胡只针对1张牌，不针对一次性听的所有牌。"
    },
    {
        term = "一炮多响：",
        description = "允许一炮多响，下一局点炮者最近的一个胡牌者下家为庄家。"
    },
    {
        term = "承包：",
        description = "如果吃碰杠一家或被一家吃碰杠超过 3 次（包括 3 次），则承包（包含反承包在内），承包时，点炮记分时，承包者付一份点数，若自摸记分时承包者付 3 份点数，例如抢杠按自摸计，抢杠时承包付 3 份。若两人各自相互有承包和被承包关系，那么重复计算。"
    },
    {
        term = "勒子：",
        description = "a）相当于输分的封顶值，大过该封顶值以该封顶值计算。\nb）荒番、开宝、清碰、风一色可以达到2个勒子的封顶数，即双勒。\nc）风碰可以达到4个勒子的封顶数，即四勒。\nd）荒番、开宝可以将勒子数提升2倍。比如清碰+开宝为4勒子，风碰+荒番为8勒子。\ne）杠开和大吊车可以将不足勒子的牌型直接计算为勒子，达到或超过勒子按照原牌型计算。"
    },
    {
        term = "开宝：",
        description = "扔骰子时 2 个骰子点数一样、点数为1、4为开宝，本局若胡则积分*2。若有开宝则积分按照*2计算，如果积分达到勒子则勒子数也*2。"
    },
    {
        term = "花：",
        description = "a）春夏秋冬梅兰竹菊每个计一朵花，如果这8个花抓起即可胡牌，此时胡牌直接算两个勒子，如果抓满这8个后按其他方式胡牌，则其他胡法照算。 \nb）筒条万每有一个明杠计一朵花，每有一个暗杠计 2 朵花。 \nc）东南西北每有一刻（3个一样的算一刻）计一朵花，每有一个明杠计2朵花，每有一个暗杠计3朵花。\nd）中发白每有一刻计2朵花，每有一个明杠计3朵花，每有一个暗杠计4朵花"
    },
    {
        title = "胡牌规则",
    },
    {
        term = "抓满春夏秋冬梅兰竹菊8朵花即可马上胡牌。此牌型叫做八花齐。",
    },
    {
        term = "胡牌只能胡碰碰胡、清一色、清碰、混一色、混碰、风一色、风碰的牌型。",
    },
    {
        term = "杠开 ( 杠上花 )：",
        description = "杠牌后补张的牌如果能胡则为杠开，补张为最后一墩的牌的上面那张，补完再补最后一墩下面这张。杠开胡牌时积分不足勒子按照勒子算，达到勒子或超过勒子则也按照勒子算。"
    },
    {
        term = "开宝：",
        description = "扔骰子时 2 个骰子点数一样、点数为1、4为开宝，本局若胡则积分*2。若有开宝则积分按照*2计算，如果积分达到勒子则勒子数也*2。"
    },
    {
        term = "荒番：",
        description = "一局结束时为和局，则下局为荒番局。下局若有胡则*2，若下局不胡继续追加荒番，并且显示在下下局中，直到有人胡为止，每有人胡1次则荒番减1（例如：第1局和局，那么第2局为荒番（1），如果第2局同样和局那么第3局为荒番（2），如果第3局还是和局那么第4局为荒番（3），如果第4局有人胡牌则根据荒番结果翻倍，同时第5局为荒番（2），以此类推）。一旦游戏的4人中有任意1人离开，则荒番失效，荒番只应用于某4人坐下后无任一人离开。若有荒番则积分按照*2计算，如果积分达到勒子则勒子数也*2。"
    },
    {
        term = "大吊车：",
        description = "胡牌时其他牌都吃碰杠下 , 只剩一张牌单吊胡的为大吊车。大吊车胡牌时积分不足勒子按照勒子算，达到勒子或超过勒子则也按照勒子算。"
    },
   
}
SH_FAN_TABLE = 
{
    {
        title = "番型"
    },
    {
        term = "碰碰胡：",
        description = "即每坎牌都是三张一样的或碰杠下的牌。",
        cards = {0x27,0x27,0x27,0x08,0x08,0x08,0x17,0x17,0x17,0x09,0x09,0x09,0x28,0x28}

    },
    {
        term = "混一色：",
        description = "胡牌时是由同一花色的牌和风向牌构成的牌。",
        cards = {0x01,0x02,0x03,0x01,0x02,0x03,0x07,0x08,0x09,0x07,0x08,0x09,0x41,0x41}
    },
    {
        term = "清一色：",
        description = "即全副牌是一种花色。若胡则直接结算为1个勒子。",
        cards = {0x11,0x12,0x13,0x12,0x13,0x14,0x13,0x14,0x15,0x18,0x18,0x18,0x19,0x19}
    },
    {
        term = "混碰：",
        description = "即混一色的碰碰胡。若胡则直接结算为1个勒子。",
        cards = {0x22,0x22,0x22,0x23,0x23,0x23,0x24,0x24,0x24,0x25,0x25,0x25,0x33,0x33}
    },
    {
        term = "清碰：",
        description = "即清一色的碰碰胡。若胡则直接结算为2个勒子。",
        cards = {0x22,0x22,0x22,0x23,0x23,0x23,0x24,0x24,0x24,0x28,0x28,0x28,0x26,0x26}
    },
    {
        term = "风一色：",
        description = "即全副牌都是风向牌，可以是乱风向的牌。若胡则直接结算为2个勒子。",
        cards = {0x31,0x31,0x31,0x32,0x32,0x33,0x33,0x34,0x34,0x34,0x41,0x42,0x43,0x43}
    },
    {
        term = "风碰：",
        description = "即全副牌都是风向牌且是碰碰胡。若胡则直接结算为4个勒子。",
        cards = {0x31,0x31,0x31,0x34,0x34,0x34,0x41,0x41,0x41,0x43,0x43,0x43,0x33,0x33}
    },
}