GD_RULE_TABLE = 
{
	{
        title = "一.游戏简介",
        item = {
            "  游戏采用湖北地区流行的麻将打法，牌面只有筒、条两门和中发白，无东南西北风，共84张牌，为三人制麻将。游戏中不可以吃牌，最后一张自动胡牌，剩余最后一张牌时不可以杠牌（杠牌需要补摸牌，最后一张牌后无牌可摸）。"
        }
    },
    {
        title = "二.术语解释",
        item = {
            {
                title = "  1）漂",
                item  = "  ①”漂”即在游戏开始时下定一定额度的金币数,在游戏结算时额外增加或者减少相应的金币数;\n  ②玩家自摸,则除收取胡牌所得金币外另收取三人选择的漂的数量之和的金币,输牌玩家需要扣除被胡牌所输金币外另扣除赢家和自身选择的漂的数量之和的金币；\n  ③玩家胡他人放炮,则除收取胡牌所得金币外另收取自己和放炮者选择的漂的数量之和的金币,放炮玩家需要扣除被胡牌所输金币外另扣除赢家和自身选择的漂的数量之和的金币。",
            },
            {
                title = "  2）定庄",
                item  = "  ①第一局随机确定庄家;\n  ②以后每局庄家为上一局第一个胡牌的玩家;\n  ③一炮双响的时候，放炮玩家为下局庄家;\n  ④若流局，则本局的庄家依旧为下局的庄家;\n  ⑤若中途有玩家离开游戏房间，则继续随机确定庄家。",
            },
            {
                title = "  3）杠",
                item  = "  ①游戏中分暗杠、明杠（含直杠和补杠），杠牌立即获得喜钱。\n  ②暗杠：自己抓到四张牌开杠，二家各出2倍底注。\n  ③直杠：手上有三个相同的牌，其他玩家打出另一张相同的牌。点杠者出2倍底注；另外一家不出。\n  ④补杠：碰了以后自己摸到另外一张牌，必须当时就杠 ，否则，不能再杠。二家各出1倍底注。\n  ⑤杠上杠：玩家开杠后打出的牌被别人杠或者自己继续杠，叫做“杠上杠”。 杠上杠的要翻倍（第一杠不翻倍），如果杠完之后又被人杠或者自己杠，就再翻一倍，以此类推；每杠的钱都要算，不是只算最后一杠.",
            },
            {
                title = "  4）亮倒",
                item  =  "  ①听牌后，可以选择把手中的牌亮出来给所有人看着打，若手上有三张同样的牌，则可以选择遮住，若选择遮住，则不可以算作其他顺子、刻子中。\n  ②亮倒后不可以换手中的牌，在不破坏牌型的情况下可以进行杠牌操作。\n  ③亮倒后可以自摸也可以胡其他玩家的牌，但是若其他玩家放炮给亮倒玩家，则需要赔付包胡的钱。\n  ④亮倒后胡牌积分翻番；但喜钱不翻番，如果有玩家点炮，那么，点炮者出双份.",
            },
            {
                title = "  5）荒庄",
                item  = "  ①84张牌全部摸完后依然没人胡牌为荒庄。\n  ②荒庄不下庄、荒庄不影响杠钱。\n  ③亮倒和荒庄：\n    a.一个玩家亮倒，亮倒的那个玩家要赔两个没有亮倒的玩家每人1倍底注;\n    b. 两个玩家亮倒，分别要赔没有亮倒的玩家1倍底注;\n    c.三个玩家都亮倒，都不赔.",
            },
            {
                title = "  6）漏胡",
                item  = "  如果一家点炮A没有胡牌，那么，A在没有抓牌的情况下，不管A胡什么牌，都不能胡另外玩家打出的牌.",
            },
        }
    },
}

GD_FAN_TABLE = 
{
    {
        title = "1.番型",
        item = {
            {
                item  = {
                    {
                        desc = "  屁胡：即普通的四坎牌加一对将。X1",
                        cards = { 0x22, 0x22, 0x22, 0x24, 0x25, 0x26, 0x12, 0x13, 0x14, 0x18, 0x18, 0x43, 0x43, 0x43}
                    }
                }
            },
            {
                item  = {
                    {
                        desc = "  碰碰胡：由4副刻子（或杠）、将牌组成的胡牌。X2",
                        cards = { 0x22, 0x22, 0x22, 0x43, 0x43, 0x43, 0x26, 0x26, 0x26, 0x14, 0x14, 0x14, 0x18, 0x18}
                    },
                    {
                        desc = "  明四归一： 要胡的牌已被自己碰过，最后又赢这张牌。X2",
                    },
                    {
                        desc = "  杠上开花： 杠来自己要胡的牌胡牌。X2",
                    },
                    {
                        desc = "  杠上炮：杠后打出的牌被别人胡，杠钱照算。X2",
                    },
                    {
                        desc = "  抢杠胡：胡别人自抓开明杠的牌（别人自抓开暗杠的牌不可抢杠）。X2",
                    },
                    {
                        desc = "  亮倒：听牌后，可以选择把手中的牌亮出来给所有人看着打。X2",
                    },
                    {
                        desc = "  海底捞月：胡整副牌的最后一张（第84张）牌。X2",
                    },
                    {
                        desc = "  卡五星：卡5饼、5条胡牌。X2",
                    },
                    {
                        desc = "  包胡：放炮给亮倒玩家。X2",
                    }

                }
            },
            {
                item  = {
                    {
                        desc = "  清一色：由一种花色的牌组成的胡牌。X4",
                        cards = { 0x21, 0x21, 0x21, 0x22, 0x23, 0x24, 0x24, 0x25, 0x26, 0x27, 0x27, 0x27, 0x29, 0x29}
                    },
                    {
                        desc = "  暗四归一： 要胡的牌自己手上已有三张，最后又赢到这张牌。X4",
                    },
                    {
                        desc = "  手抓一：已碰了四对牌，手中只剩一张牌 。X4",
                    },
                    {
                        desc = "  七对：7个对子组成的的胡牌。X4",
                        cards = { 0x11, 0x11, 0x13, 0x13, 0x15, 0x15, 0x23, 0x23, 0x26, 0x26, 0x27, 0x27, 0x29, 0x29}
                    },
                    {
                        desc = "  小三元：胡牌时，有中发白的两副刻子(杠)和一对将牌。X4",
                        cards = { 0x27, 0x28, 0x29, 0x16, 0x17, 0x18, 0x41, 0x41, 0x41, 0x42, 0x42, 0x42, 0x43, 0x43}
                    },
                }
            },
            {
                item  = {
                    {
                        desc = "  龙七对：7对牌中间，有四个相同的牌当做两个对子使用（不再计算暗四归一的番数）。X8",
                        cards = { 0x11, 0x11, 0x13, 0x13, 0x15, 0x15, 0x23, 0x23, 0x26, 0x26, 0x27, 0x27, 0x27, 0x27}
                    },
                    {
                        desc = "  大三元：胡牌时，有中发白3副刻子(杠)。X8",
                        cards = { 0x41, 0x41, 0x41, 0x42, 0x42, 0x42, 0x43, 0x43, 0x43, 0x13, 0x13, 0x13, 0x25, 0x25}
                    },
                } 
            },
            {
                item  = {
                    {
                        desc = "  双龙七对：7对牌中间，有两个四个相同的牌当做四个对子使用（不再计算暗四归一的番数）。X16",
                        cards = { 0x11, 0x11, 0x13, 0x13, 0x15, 0x15, 0x23, 0x23, 0x23, 0x23, 0x27, 0x27, 0x27, 0x27}
                    },
                } 
            },
        }
    },
    {
        title = "2.计算",
        item  = {            
            {
                title = "  1）正常胡牌（无逃跑、荒庄）",
                item  = {
                    "  ①基本输（赢）金币，即底注X倍数+杠钱+漂钱。系统每局向每位玩家收取固定的服务费。\n  ②点炮，只有点炮者输金币，自摸胡，所有未胡者输金币。\n  ③一炮多响，按玩家之间各自一对一计算金币。"
                }
            },
            {
                title = "  2）逃跑处理",
                item  = {
                    "  玩家逃跑后由系统代打，参与最后结算。"
                }
            },
        },
    },
}
